app/Controllers/AdminController.php

SELECT MONTH(fecha) as mes, SUM(monto) as total
FROM `pedidos`
GROUP BY `mes`
ORDER BY `mes` ASC
---
    public function index()
    {
        $pedidosModel = new Pedido();

        // Realiza la consulta a la base de datos para obtener la cantidad de pedidos por mes
        $result = $pedidosModel->select('MONTH(fecha) as mes, SUM(monto) as total')
            ->groupBy('mes')
            ->orderBy('mes', 'ASC')
            ->findAll();

SELECT `pedidos`.*, `u`.`nombre` AS `usuario`
FROM `pedidos`
JOIN `usuarios` `u` ON `pedidos`.`id_usuario` = `u`.`id`
---
    public function showPedido()
    {
        $pedidoModel = new Pedido();
        $data['data'] = $pedidoModel->select('pedidos.*, u.nombre AS usuario')
            ->join('usuarios u', 'pedidos.id_usuario = u.id')
            ->findAll();

SELECT COUNT(`id`) AS `id`
FROM `pedidos`
WHERE `leido` = '1'
 LIMIT 1
---
    public function totalPedidos(){
        $pedidoModel = new Pedido();
        $data['data'] = $pedidoModel->selectCount('id')
            ->where('leido', '1')
            ->first();