app/Controllers/CalificacionController.php

    public function agregar()
    {
        $productoId = $this->request->getPost('producto_id');
        $calificacion = $this->request->getPost('rating');
        $comentario = $this->request->getPost('comentario');
        $usuarioId = $this->session->user_id;

        $validation = \Config\Services::validation();
        $validation->setRule('rating', 'calificacion', 'required');

        // Redirigir o mostrar un mensaje de éxito
        $productoModel = new Producto();
        $producto = $productoModel->find($productoId);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '49'