app/Controllers/DescargaController.php

    public function index()
    {
        $pedidos = new Pedido();
        $detalle = new DetallePedido();
        $id_usuario = $this->session->user_id;
        $query = $pedidos->where('id_usuario', $id_usuario)->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `pedidos`
WHERE `id_usuario` = 3
ORDER BY `id` DESC