app/Controllers/Home.php

    public function index(): string
    {
        $categorias = new Categoria();
        $productos = new Producto();
        $detalles = new DetallePedido();
        $data['categorias'] = $categorias->findAll();
        $empresa = new Configuracion();
        $data['empresa'] = $empresa->first();
        $sliders = new Slider();
        $data['sliders'] = $sliders->findAll();
        $data['tops'] = $detalles->select('SUM(detallepedidos.cantidad) as total, detallepedidos.producto, detallepedidos.id_producto, p.slug, p.imagen')
        ->join('productos AS p', 'detallepedidos.id_producto = p.id')
        ->groupBy(['detallepedidos.producto', 'detallepedidos.id_producto'])->findAll(10);
        $data['class'] = 'hero';
        $data['active'] = 'inicio';
        $data['productos'] = $productos->orderBy('id', 'DESC')->findAll(12);
---
SELECT *
FROM `categorias`
SELECT *
FROM `configuracion`
 LIMIT 1
SELECT *
FROM `sliders`
SELECT SUM(detallepedidos.cantidad) as total, `detallepedidos`.`producto`, `detallepedidos`.`id_producto`, `p`.`slug`, `p`.`imagen`
FROM `detallepedidos`
JOIN `productos` AS `p` ON `detallepedidos`.`id_producto` = `p`.`id`
GROUP BY `detallepedidos`.`producto`, `detallepedidos`.`id_producto`
 LIMIT 10
SELECT *
FROM `productos`
ORDER BY `id` DESC
 LIMIT 12