app/Controllers/LoginController.php

    public function login()
    {
        $data['register'] = false;
        $validation = \Config\Services::validation();
        $validation->setRule('usuario', 'usuario', 'required');
        $validation->setRule('password', 'contraseña', 'required');

        if (!$validation->withRequest($this->request)->run()) {
            $data['username_error'] = $validation->getError('usuario');
            $data['password_error'] = $validation->getError('password');

            return view('admin/login', $data);
        }

        $userModel = new \App\Models\Usuario();
        $username = $this->request->getVar('usuario');
        $password = $this->request->getVar('password');

        $user = $userModel->where('usuario', $username)
            ->orWhere('correo', $username)
            ->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'nuevo'
OR `correo` = 'nuevo'
 LIMIT 1

    public function register()
    {
        $validation = \Config\Services::validation();
        $validation->setRule('nombre_registro', 'nombre', 'required');
        $validation->setRule('apellido_registro', 'apellido', 'required');
        $validation->setRule('correo_registro', 'correo', 'required|valid_email|is_unique[usuarios.correo]');
        $validation->setRule('usuario_registro', 'usuario', 'required|is_unique[usuarios.usuario]');
        $validation->setRule('password_registro', 'contraseña', 'required');

        if (!$validation->withRequest($this->request)->run()) {
            $data['nombre_registro_error'] = $validation->getError('nombre_registro');
            $data['apellido_registro_error'] = $validation->getError('apellido_registro');
            $data['correo_registro_error'] = $validation->getError('correo_registro');
            $data['usuario_registro_error'] = $validation->getError('usuario_registro');
            $data['password_registro_error'] = $validation->getError('password_registro');
            $data['register'] = true;
            return view('admin/login', $data);
        }

        $userModel = new \App\Models\Usuario();

        $user = $userModel->insert([
            'nombre' => $this->request->getPost('nombre_registro'),
            'apellido' => $this->request->getPost('apellido_registro'),
            'usuario' => $this->request->getPost('usuario_registro'),
            'correo' => $this->request->getPost('correo_registro'),
            'password' => password_hash($this->request->getVar('password_registro'), PASSWORD_DEFAULT),
            'rol' => 'usuario'
        ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `correo`, `password`, `rol`) VALUES ('Angel', 'Sifuentes.net', 'angel', 'angel@gmail.com', '$2y$10$eDQH4ZOtcezihE8ouTe2PuixtP7O461rIGKDditNHGTm2CAWGevme', 'usuario')