app/Controllers/PerfilController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
    public function index()
    {
        $usuario = new Usuario();
        $data['usuario'] = $usuario->find($this->session->user_id);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '1'
---
                $data['validation'] = $this->validator;
            }

            $data['usuario'] = $usuarioModel->find($id);