app/Controllers/TiendaController.php

    public function index(): string
    {
        $empresa = new Configuracion();
        $data['empresa'] = $empresa->first();
        $categorias = new Categoria();
        $productos = new Producto();
        $data['class'] = 'hero hero-normal';
        $data['active'] = 'tienda';
        $data['categorias'] = $categorias->findAll();

        $config = [
            'baseURL' => base_url('TiendaController/index'), // Cambia 'controlador/mostrarProductos' por la URL de tu controlador y método
            'totalRows' => $productos->countAll(), // Obtiene el total de filas de tu modelo
            'perPage' => 12, // Número de productos por página
        ];

        $data['productos'] = $productos->orderBy('id', 'DESC')->paginate($config['perPage']);
        $data['paginador'] = $productos->pager;
        $data['totalProductos'] = $productos->countAllResults();
---
SELECT *
FROM `configuracion`
 LIMIT 1
SELECT *
FROM `categorias`
SELECT COUNT(*) AS `numrows` FROM `productos`
SELECT *
FROM `productos`
ORDER BY `id` DESC
 LIMIT 12, 12
SELECT COUNT(*) AS `numrows`
FROM `productos`

    public function carrito(): string
    {
        $empresa = new Configuracion();
        $data['empresa'] = $empresa->first();
        $data['class'] = 'hero hero-normal';
        $data['active'] = 'carrito';
        $categorias = new Categoria();
        $data['categorias'] = $categorias->findAll();
---
SELECT *
FROM `configuracion`
 LIMIT 1
SELECT *
FROM `categorias`

    public function detail($slug)
    {
        $empresa = new Configuracion();
        $data['empresa'] = $empresa->first();
        $data['class'] = 'hero hero-normal';
        $data['active'] = 'tienda';

        $categorias = new Categoria();
        $productoModel = new Producto();
        $calificacionModel = new Calificacion();

        // Obtener información del producto
        $data['categorias'] = $categorias->findAll();
        $data['producto'] = $productoModel->where('slug', $slug)->first();

        // Obtener la calificación promedio del producto
        $productoId = $data['producto']['id'];
        $promedioCalificacion = $calificacionModel->where('id_producto', $productoId)
            ->selectAvg('calificacion', 'promedio_calificacion')
            ->first();

        // Agregar la calificación promedio al array de datos
        $data['promedio_calificacion'] = ($promedioCalificacion && $promedioCalificacion['promedio_calificacion'] !== null)
            ? round($promedioCalificacion['promedio_calificacion'], 1)
            : null;

        $data['calificaciones'] = $calificacionModel->select('calificaciones.calificacion,calificaciones.comentario, u.nombre')
            ->join('usuarios AS u', 'calificaciones.id_usuario = u.id')
            ->where('calificaciones.id_producto', $productoId)
            ->orderBy('calificaciones.id', 'desc')
            ->findAll();
---
SELECT *
FROM `configuracion`
 LIMIT 1
SELECT *
FROM `categorias`
SELECT *
FROM `productos`
WHERE `slug` = 'cumque-occaecati-iure-qui-commodi'
 LIMIT 1
SELECT `calificaciones`.`calificacion`, `calificaciones`.`comentario`, `u`.`nombre`
FROM `calificaciones`
JOIN `usuarios` AS `u` ON `calificaciones`.`id_usuario` = `u`.`id`
WHERE `calificaciones`.`id_producto` = '49'
ORDER BY `calificaciones`.`id` DESC

    public function categorias($slug): string
    {
        $empresa = new Configuracion();
        $data['empresa'] = $empresa->first();
        $data['class'] = 'hero hero-normal';
        $data['active'] = 'tienda';
        $categorias = new Categoria();
        $producto = new Producto();
        $data['categorias'] = $categorias->findAll();
        $data['categoria'] = $categorias->where('slug', $slug)->first();
        $id_categoria = $data['categoria']['id'];

        $config = [
            'baseURL' => base_url('TiendaController/index'), // Cambia 'controlador/mostrarProductos' por la URL de tu controlador y método
            'totalRows' => $producto->countAll(), // Obtiene el total de filas de tu modelo
            'perPage' => 12, // Número de productos por página
        ];

        $data['productos'] = $producto->where('id_categoria', $id_categoria)->orderBy('id', 'DESC')->paginate($config['perPage']);
        $data['paginador'] = $producto->pager;
        $data['totalProductos'] = $producto->where('id_categoria', $id_categoria)->countAllResults();
---
SELECT *
FROM `configuracion`
 LIMIT 1
SELECT *
FROM `categorias`
SELECT *
FROM `categorias`
WHERE `slug` = 'iusto-sed'
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `productos`
SELECT *
FROM `productos`
WHERE `id_categoria` = '1'
ORDER BY `id` DESC
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `id_categoria` = '1'